Autodesk.Revit.DB.BuiltInFailures.RevisionCloudFailures.ProhibitSwitchToIssuedRevision
Can't add cloud to an Issued Revision.

Autodesk.Revit.DB.BuiltInFailures.RevisionCloudFailures.ProhibitSwitchFromIssuedRevision
Can't remove cloud from an Issued Revision.

Autodesk.Revit.DB.BuiltInFailures.RevisionCloudFailures.ProhibitModificationOfIssuedRevisionCloud
Issued Revision Clouds can't be modified.

Autodesk.Revit.DB.BuiltInFailures.RevisionCloudFailures.ProhibitCreationInIssued
The most current project revision has been issued.  No new revision clouds can be created in it.  Please add a new revision to the global revision table.

Autodesk.Revit.DB.BuiltInFailures.RevisionCloudFailures.ModifyingIssuedRevisionCloudOnUpgrade
During upgrade, an issued revision cloud was moved.  Please double check the revision cloud to ensure it is located in the correct place.

Autodesk.Revit.DB.BuiltInFailures.RevisionCloudFailures
Failures about RevisionCloud.